#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.keycloak_test.data.keycloak_realm.pltsvc: Reading...
module.keycloak_test.data.keycloak_realm.pltsvc: Read complete after 0s [id=platform-services]
module.keycloak_test.data.keycloak_authentication_flow.idir_only: Reading...
module.keycloak_test.data.keycloak_openid_client.realm_management: Reading...
module.keycloak_prod.data.keycloak_realm.pltsvc: Reading...
module.keycloak_test.data.keycloak_authentication_flow.idir_only: Read complete after 0s [id=851e3327-b5ec-448d-b49d-c5d48a637053]
module.keycloak_test.keycloak_openid_client.pltsvc: Refreshing state... [id=513cb1b1-25da-4095-8ed9-1afa59ca716e]
module.keycloak_dev.data.keycloak_realm.pltsvc: Reading...
module.keycloak_dev.data.keycloak_realm.pltsvc: Read complete after 0s [id=platform-services]
module.keycloak_prod.data.keycloak_realm.pltsvc: Read complete after 0s [id=platform-services]
module.keycloak_dev.data.keycloak_authentication_flow.idir_only: Reading...
module.keycloak_dev.data.keycloak_openid_client.realm_management: Reading...
module.keycloak_prod.data.keycloak_authentication_flow.idir_only: Reading...
module.keycloak_prod.data.keycloak_openid_client.realm_management: Reading...
module.keycloak_dev.keycloak_openid_client.pltsvc_admin_cli: Refreshing state... [id=319c1c0f-cc23-43b8-a46e-a342000cd8e7]
module.keycloak_dev.data.keycloak_authentication_flow.idir_only: Read complete after 0s [id=b2ba3f76-7315-4b9a-afb4-19d8f40cb401]
module.keycloak_dev.keycloak_openid_client.pltsvc: Refreshing state... [id=13514f3c-0d09-4ecf-860f-d34cbcebd7b2]
module.keycloak_prod.data.keycloak_authentication_flow.idir_only: Read complete after 0s [id=2034bcea-651d-47f2-a434-e9bb42fed53f]
module.keycloak_prod.keycloak_openid_client.pltsvc: Refreshing state... [id=624b2484-cb5b-4d1e-9a7f-87558a01cefd]
module.keycloak_test.data.keycloak_openid_client.realm_management: Read complete after 0s [id=ea2d479d-2101-46f3-b085-329908eedab3]
module.keycloak_test.data.keycloak_role.realm_admin: Reading...
module.keycloak_test.keycloak_role.pltsvc_private_reader: Refreshing state... [id=3fc77651-0a5e-4011-9d48-64f4bfe93b67]
module.keycloak_test.keycloak_role.pltsvc_public_reader: Refreshing state... [id=de1c5611-7e7b-49e8-88a8-2a2ff7e0c19c]
module.keycloak_test.keycloak_role.pltsvc_reader: Refreshing state... [id=6468e5fd-5038-4555-9e43-00b7269566ef]
module.keycloak_test.keycloak_role.pltsvc_public_analyzer: Refreshing state... [id=78b7e8d0-bec9-432b-bccf-cac59e09b3b3]
module.keycloak_prod.data.keycloak_openid_client.realm_management: Read complete after 0s [id=06689fcc-d531-42c5-bafe-d65308d0e21c]
module.keycloak_test.keycloak_role.pltsvc_ministry_reader["embc"]: Refreshing state... [id=4708b9cf-203d-457e-bb7c-b29bb0887c79]
module.keycloak_test.data.keycloak_role.realm_admin: Read complete after 0s [id=29b6adbd-4117-40dd-a5dd-c41e0adc1025]
module.keycloak_test.keycloak_role.pltsvc_ministry_reader["hous"]: Refreshing state... [id=c5eb1e5c-0b90-43d1-ac0f-d3695382b485]
module.keycloak_dev.data.keycloak_openid_client.realm_management: Read complete after 0s [id=0e86a210-09d0-47d6-82eb-e16a17c31b15]
module.keycloak_test.keycloak_role.pltsvc_ministry_reader["pssg"]: Refreshing state... [id=dbc3714d-4a22-4dab-be1b-a0390dcbfa1e]
module.keycloak_test.keycloak_role.pltsvc_ministry_reader["ag"]: Refreshing state... [id=593c9400-a4f8-4924-a531-b491d404ef04]
module.keycloak_test.keycloak_role.pltsvc_admin: Refreshing state... [id=c6533941-c13f-458e-896c-476c2b711210]
module.keycloak_test.keycloak_role.pltsvc_public_editor: Refreshing state... [id=52f6b0b0-be53-49ac-8d98-c0ac0c6747d0]
module.keycloak_test.keycloak_role.pltsvc_private_admin: Refreshing state... [id=d5d89c19-2097-446b-a608-e146e196c93e]
module.keycloak_test.keycloak_role.pltsvc_public_admin: Refreshing state... [id=6502e6ad-68c4-45c2-931d-03af55f1e26f]
module.keycloak_test.keycloak_role.pltsvc_private_editor: Refreshing state... [id=02d15430-d286-474c-9198-9977576f6971]
module.keycloak_test.keycloak_role.pltsvc_editor: Refreshing state... [id=312904ac-2e41-4106-8bc8-fc15d7894857]
module.keycloak_test.keycloak_role.pltsvc_ministry_editor["ag"]: Refreshing state... [id=9382fa86-f25b-46fb-a024-d00c456d0822]
module.keycloak_test.keycloak_role.pltsvc_ministry_editor["embc"]: Refreshing state... [id=d3e2d49c-b187-4c1c-9c0a-c853e5217a08]
module.keycloak_test.keycloak_role.pltsvc_ministry_editor["hous"]: Refreshing state... [id=9d36cf8c-c079-4ec5-85b8-198babb5e7c2]
module.keycloak_test.keycloak_role.pltsvc_ministry_editor["pssg"]: Refreshing state... [id=65f59fee-230b-4bc1-984c-350ea6deaf62]
module.keycloak_test.keycloak_role.pltsvc_private_analyzer: Refreshing state... [id=c8581479-fc83-4ddd-ac75-d388b123b679]
module.keycloak_test.keycloak_role.pltsvc_analyzer: Refreshing state... [id=fdc529fd-7be5-465e-afc7-59e916d2d4e5]
module.keycloak_prod.data.keycloak_role.realm_admin: Reading...
module.keycloak_dev.data.keycloak_role.realm_admin: Reading...
module.keycloak_prod.keycloak_role.pltsvc_private_analyzer: Refreshing state... [id=b801ac21-17d6-49ff-9eb2-b3faf12c7b6b]
module.keycloak_prod.keycloak_role.pltsvc_private_reader: Refreshing state... [id=176ba2e0-0e97-4299-8bf9-d2af52133cbf]
module.keycloak_prod.keycloak_role.pltsvc_ministry_reader["hous"]: Refreshing state... [id=06aa0649-6341-433d-a104-82fdcf1043a3]
module.keycloak_prod.keycloak_role.pltsvc_editor: Refreshing state... [id=8d50fd4b-8542-4c1a-ab85-b156ec754be5]
module.keycloak_prod.keycloak_role.pltsvc_ministry_reader["pssg"]: Refreshing state... [id=13756786-11ef-40dc-bf0c-ee0b5cc0c9fa]
module.keycloak_prod.keycloak_role.pltsvc_ministry_reader["embc"]: Refreshing state... [id=1517b2de-8579-4815-919b-43d48cabdafc]
module.keycloak_prod.keycloak_role.pltsvc_ministry_reader["ag"]: Refreshing state... [id=60ef3858-9488-4fbe-9207-141873a5dd81]
module.keycloak_prod.keycloak_role.pltsvc_public_editor: Refreshing state... [id=c638dbd8-056c-4666-8953-9f5cf9070b85]
module.keycloak_dev.data.keycloak_role.realm_admin: Read complete after 0s [id=9ad8719e-f4d5-4a36-a8d1-5eb6ed6565f4]
module.keycloak_prod.keycloak_role.pltsvc_public_analyzer: Refreshing state... [id=5fb0f2ab-6109-4ed5-9144-99f2a217ba42]
module.keycloak_prod.keycloak_role.pltsvc_admin: Refreshing state... [id=9a46dcf8-0046-44da-b284-0d0e35297722]
module.keycloak_prod.data.keycloak_role.realm_admin: Read complete after 0s [id=9ac9e004-8e6b-4840-8ae1-9d7ff9a349c5]
module.keycloak_prod.keycloak_role.pltsvc_reader: Refreshing state... [id=34c99834-f778-45bc-9343-1e6a41fed1e3]
module.keycloak_prod.keycloak_role.pltsvc_private_editor: Refreshing state... [id=329c6e35-fcd6-49f7-9435-b6d16cf45fe4]
module.keycloak_prod.keycloak_role.pltsvc_private_admin: Refreshing state... [id=00c4387e-3207-4c25-b34f-4b55d3fa70e9]
module.keycloak_prod.keycloak_role.pltsvc_ministry_editor["embc"]: Refreshing state... [id=a2a72316-8746-4e57-9c47-1d8655fcd7e8]
module.keycloak_prod.keycloak_role.pltsvc_public_admin: Refreshing state... [id=df998b7d-e402-42e6-b13b-fb335b5c6f73]
module.keycloak_prod.keycloak_role.pltsvc_ministry_editor["pssg"]: Refreshing state... [id=8230a9a3-265f-4917-a814-35d45c9dcdfb]
module.keycloak_prod.keycloak_role.pltsvc_ministry_editor["hous"]: Refreshing state... [id=b29e4a5c-18e8-4fa5-b393-198c1893ea37]
module.keycloak_prod.keycloak_role.pltsvc_ministry_editor["ag"]: Refreshing state... [id=c5127226-3287-4230-9c8a-bd5df4b04b8e]
module.keycloak_prod.keycloak_role.pltsvc_public_reader: Refreshing state... [id=c2c7cc12-fd77-49ab-95ba-54177c63c2ff]
module.keycloak_prod.keycloak_role.pltsvc_analyzer: Refreshing state... [id=a847df7b-d5f5-49d3-a6f7-9f02cc0d6fe7]
module.keycloak_dev.keycloak_role.pltsvc_public_reader: Refreshing state... [id=57f3c912-b336-416a-b04c-02df07a8b0ef]
module.keycloak_dev.keycloak_role.pltsvc_private_analyzer: Refreshing state... [id=5c0330e3-45ae-46b2-b6fb-4eee1396d99c]
module.keycloak_dev.keycloak_role.pltsvc_private_reader: Refreshing state... [id=0a2a590c-aff4-49b0-a48d-80d4ce3f0083]
module.keycloak_dev.keycloak_role.pltsvc_public_analyzer: Refreshing state... [id=ff214f34-279d-423f-b991-d3d1b2bf2fb5]
module.keycloak_dev.keycloak_role.pltsvc_editor: Refreshing state... [id=098ce8b4-8f87-4b82-a6a2-05f9534347d2]
module.keycloak_dev.keycloak_role.pltsvc_ministry_reader["hous"]: Refreshing state... [id=89fa7ea1-24f8-4698-b392-bd85445dcc9e]
module.keycloak_dev.keycloak_role.pltsvc_ministry_reader["pssg"]: Refreshing state... [id=ce1dd6f3-1431-4d07-9211-81710c1ed094]
module.keycloak_dev.keycloak_role.pltsvc_admin: Refreshing state... [id=40ab6d7e-3b39-4298-a81f-ce74780ae671]
module.keycloak_dev.keycloak_role.pltsvc_ministry_reader["ag"]: Refreshing state... [id=6defbbf7-4c2b-450f-8966-8526bd19051a]
module.keycloak_dev.keycloak_role.pltsvc_ministry_reader["embc"]: Refreshing state... [id=026dd0d8-a711-4cf2-9469-f77d2712c869]
module.keycloak_dev.keycloak_role.pltsvc_analyzer: Refreshing state... [id=0735261d-737b-4712-ae97-a36dd6654621]
module.keycloak_dev.keycloak_role.pltsvc_ministry_editor["embc"]: Refreshing state... [id=ed057379-560b-4753-b7e8-44890f0e63c6]
module.keycloak_dev.keycloak_role.pltsvc_ministry_editor["pssg"]: Refreshing state... [id=0a8dab4d-2f63-4a46-8415-c50fb49072b0]
module.keycloak_dev.keycloak_role.pltsvc_ministry_editor["ag"]: Refreshing state... [id=ae31b4e8-b8cd-4614-9d66-33fd886d7180]
module.keycloak_dev.keycloak_role.pltsvc_ministry_editor["hous"]: Refreshing state... [id=f60c0731-d748-4241-8de1-a8a2915c752b]
module.keycloak_dev.keycloak_role.pltsvc_public_editor: Refreshing state... [id=5cf36e80-ca5d-4d4d-a6ea-01bceb272afc]
module.keycloak_dev.keycloak_role.pltsvc_public_admin: Refreshing state... [id=33fcc411-5b98-4725-bddc-8c71858f248d]
module.keycloak_dev.keycloak_role.pltsvc_private_editor: Refreshing state... [id=cac88ed0-d717-42eb-b41a-53abcc079a0a]
module.keycloak_dev.keycloak_role.pltsvc_reader: Refreshing state... [id=50703212-4b4f-4d05-b059-979d9e6387b7]
module.keycloak_dev.keycloak_role.pltsvc_private_admin: Refreshing state... [id=c7eebdf4-2374-4385-9026-b1b878f87c92]
module.keycloak_dev.keycloak_openid_client_service_account_role.pltsvc_admin_cli_realm_admin: Refreshing state... [id=993e500c-d9de-4c7b-883d-0dc1952ce358/9ad8719e-f4d5-4a36-a8d1-5eb6ed6565f4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_prod.keycloak_openid_client.pltsvc_admin_cli will be created
  + resource "keycloak_openid_client" "pltsvc_admin_cli" {
      + access_token_lifespan                     = (known after apply)
      + access_type                               = "CONFIDENTIAL"
      + admin_url                                 = (known after apply)
      + backchannel_logout_session_required       = true
      + base_url                                  = (known after apply)
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "pltsvc-admin-cli"
      + client_offline_session_idle_timeout       = (known after apply)
      + client_offline_session_max_lifespan       = (known after apply)
      + client_secret                             = (sensitive value)
      + client_session_idle_timeout               = (known after apply)
      + client_session_max_lifespan               = (known after apply)
      + consent_required                          = (known after apply)
      + consent_screen_text                       = (known after apply)
      + description                               = (known after apply)
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = (known after apply)
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = (known after apply)
      + frontchannel_logout_enabled               = (known after apply)
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + import                                    = false
      + name                                      = "platform registry app admin CLI"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "platform-services"
      + resource_server_id                        = (known after apply)
      + root_url                                  = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_post_logout_redirect_uris           = (known after apply)
      + valid_redirect_uris                       = (known after apply)
      + web_origins                               = (known after apply)
    }

  # module.keycloak_prod.keycloak_openid_client_service_account_role.pltsvc_admin_cli_realm_admin will be created
  + resource "keycloak_openid_client_service_account_role" "pltsvc_admin_cli_realm_admin" {
      + client_id               = "06689fcc-d531-42c5-bafe-d65308d0e21c"
      + id                      = (known after apply)
      + realm_id                = "platform-services"
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.keycloak_openid_client.pltsvc_admin_cli will be created
  + resource "keycloak_openid_client" "pltsvc_admin_cli" {
      + access_token_lifespan                     = (known after apply)
      + access_type                               = "CONFIDENTIAL"
      + admin_url                                 = (known after apply)
      + backchannel_logout_session_required       = true
      + base_url                                  = (known after apply)
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "pltsvc-admin-cli"
      + client_offline_session_idle_timeout       = (known after apply)
      + client_offline_session_max_lifespan       = (known after apply)
      + client_secret                             = (sensitive value)
      + client_session_idle_timeout               = (known after apply)
      + client_session_max_lifespan               = (known after apply)
      + consent_required                          = (known after apply)
      + consent_screen_text                       = (known after apply)
      + description                               = (known after apply)
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = (known after apply)
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = (known after apply)
      + frontchannel_logout_enabled               = (known after apply)
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + import                                    = false
      + name                                      = "platform registry app admin CLI"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "platform-services"
      + resource_server_id                        = (known after apply)
      + root_url                                  = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_post_logout_redirect_uris           = (known after apply)
      + valid_redirect_uris                       = (known after apply)
      + web_origins                               = (known after apply)
    }

  # module.keycloak_test.keycloak_openid_client_service_account_role.pltsvc_admin_cli_realm_admin will be created
  + resource "keycloak_openid_client_service_account_role" "pltsvc_admin_cli_realm_admin" {
      + client_id               = "ea2d479d-2101-46f3-b085-329908eedab3"
      + id                      = (known after apply)
      + realm_id                = "platform-services"
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @junminahn, Action: `pull_request`*